### Import

In [4]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

### Persiapan data frame

In [5]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),
                 columns=cols)
df

    A   B   C   D   E
0   3   9   5   5   6
1  14   1  12  16   1
2  13   1   6  11   7
3  18  11  17  17  17
4  11   8   1   9  13
5  15   2  16  12  15
6   7   1  11  10  15
7  12  17  18  18  15
8  10  13   1  18  17
9  16   7  14  19   8

### Seleksi kolom dan baris menggunakan loc

In [7]:
## Bag pertama untuk baris, bag 2 untuk kolom

In [6]:
df.loc[[0,3,4],['B','E']]

    B   E
0   9   6
3  11  17
4   8  13

### Seleksi baris dengan kondisi

In [8]:
df.loc[df['B'] >10 , ['B','C','E']]

    B   C   E
3  11  17  17
7  17  18  15
8  13   1  17

### Slicing data frame dengan loc

In [10]:
## : artinya sampai dengan

In [9]:
df.loc[0:4,'B':'D']

    B   C   D
0   9   5   5
1   1  12  16
2   1   6  11
3  11  17  17
4   8   1   9